[
  {
    "situation": "Our engineering project aimed to design student housing buildings that incorporate a rooftop gathering space. The objective was to provide an optimal living and learning environment for students, while also considering sustainability and utility.",
    "task_action": "To approach this project with integrity and responsibility, we began by conducting comprehensive research on sustainable building technologies and incorporating ethical issues into our design process. We built a collaborative team, with each member contributing their experience and thoughts. Our initial step was to conduct intensive brainstorming sessions in which we considered many design choices while keeping ethical ideals like environmental impact, accessibility, and social responsibility in mind. We next carefully examined the project's location, taking into account aspects such as sunshine exposure, wind patterns, and community needs. This influenced our decision-making process and assured that our design would complement the surrounding environment and serve the neighbourhood. During the design and building stages, we prioritised ethical considerations such as using ecologically friendly materials, optimising energy efficiency, and encouraging inclusiveness in our design. We also maintained transparency and honesty in our contact with stakeholders, addressing any ethical issues or conflicts that developed during the project.",
    "result": "Due to our ethical and socially responsible approach, we were able to effectively produce a design that fulfilled our clients' needs while maintaining ethical standards. Our final layout incorporated sustainable aspects such as solar panels, rainwater collection systems, and green spaces, demonstrating our commitment to the environment. Furthermore, our design emphasised accessibility and inclusivity, including wheelchair ramps and gender-neutral amenities, ensuring that all students could readily use and enjoy the lodgings. Overall, our project demonstrated the importance of ethics, integrity, and social responsibility in engineering design and construction. We not only attained our technological objectives, but also made a positive contribution to society and the environment by incorporating ethical issues at all stages of the process.",
    "id": "Ref_0001"
  },
  {
    "situation": "When approaching any engineering task, using data driven decision making is absolutely crucial. Collecting data in engineered structures allows engineers to have a clearer and scientifically supported understanding of their mechanism. By incorporating derived data into your decisions surrounding your product you will be able to produce a higher quality result. Through learning this during the ENGG1050 unit, the quality of our RGM machine was thus called into question when collecting data on the reliability of the machine to complete each individual function. We had many events in the function that originally had a low reliability score when tested 10 times. It was decided that we would need to have a discussion on how to improve these events and use our current data to assist our decisions.",
    "task_action": "Therefore, by utilising this method we held a team discussion on what areas of the questioned events was causing the weakness by analysing and assessing our current data. We next changed necessary variables in each event until the accuracy met the satisfaction of the entire team. This step was repeated a number of times to ensure the highest result was obtained, such as assessing whether a change in the weight of the ball, reinforcement of elements of the events or a multitude of things being incorporated simultaneously would produce the highest reliability score. When incorporating this tactic into our RGM machine my team and I were able to significantly improve our machine's accuracy and reliability, therefore increasing the overall quality of our product.",
    "result": "Through my team's shared desire to produce a high quality machine that could be reproducible due to high reliability scores we used our collection of data to effect our decisions of each individual event. This proved to be an incredibly efficient and effective tactic for our RGM. We are all very pleased with the new reliability results of our RGM with each event achieving at least 90% reliability.",
    "id": "Ref_0002"
  },
  {
    "situation": "We needed to add space for stairs in our model, however, there were obstructions between other rooms.",
    "task_action": "As a team, we communicated and collaborated our ideas, which were to rearrange the rooms to make enough space for stairs to be added. This included remeasuring our spaces to match the area of the requirements and extending some places to fit in other areas. Each of our group members proposed a rearrangement, and together we decided which position was best.",
    "result": "We were able to fit in stairs to get to each level of our student housing accomodation together. This ensured that all of our group members were satisfised with the decision. It also allowed us stay within the requirements for the model making project.",
    "id": "Ref_0003"
  },
  {
    "situation": "As a first year engineering student completing the ENGG1050 unit, I was placed in a group of people who I have never met, and tasked with completing a Rube Goldberg Machine project with this group.",
    "task_action": "Throughout the weeks of working together, I faced many challenges in areas such as communication and decision-making. As a first-year student joining a new group of students, I was quite nervous when introducing myself for the first time as I did not know anyone, and was unsure if someone would turn out to be unfriendly or judgemental. I would focus on finishing our given task which resulted in all of us effectively working together. However, this required a lot of initiative as I had to \"break the ice\" and remove the feeling of anxiety and nervousness that I had. Additionally, I also had to face many scenarios where me and my group were uncertain of what we should do. This forced me to take the initiative and provide possible solutions that we could use to finally make a decision in order to progress and move forward.",
    "result": "As a result, I was able to gain a lot of experience in dealing with situations where I feel anxious or uncertain of what to do, especially in a space where I do not know anyone. I was also able to take the initiative in many scenarios and try to make the best decision possible when facing uncertainty, effectively improving my communication, initiative, and decision-making skills.",
    "id": "Ref_0004"
  },
  {
    "situation": "During the duration of the semester, the team and I were tasked with designing and building a Rube Goldberg Machine. The project encouraged an exemplary sense of engineering principles whilst amplifying the roles and responsibilities of student engineers. Our team came up with the marquee idea of tackling the tedious task of feeding our pets.",
    "task_action": "From the very beginning the team and I stressed the importance of a systematic approach to problem solving, this would further enhance our roles and responsibilities of what it means to be an engineer. Our brainstorming sessions were calculated and meticulously designed to get the very best out of everyone, through this stage we identified the strengths and weaknesses of each individual and progressed further. The building stage required integral engineering skills, such as the use of an Arduino and the need to apply enough tension to a string to get the desired amount of elevation. Once the machine was assembled and the functionality of the machine was tested it was incumbent on the team to analyse any problems we encountered, it was incumbent on us to find the root cause, devise and implement a solution. This not only highlighted our ability to manage resources and time efficiently, it highlighted our ability to problem solve which is essential in the role and responsibilities of an engineer.",
    "result": "The result was a fully functioning automated pet feeding system, the contraption was built through a series of trial and error which intuitively highlighted our engineering capabilities but also provided a hands-on understanding of the roles and responsibilities of engineering. The experience to create an RGM contraption that allows us to feed our pets autonomously highlighted the broad spectrum and vital role that engineering plays in our day to day lives.",
    "id": "Ref_0005"
  },
  {
    "situation": "We needed to figure out how to present one of our presentations during class and explain briefly on the topic of Arduino and its necessities in the modern world.",
    "task_action": "Since our main focus is on the importance of oral presentations, we all gathered up in a group of 5 and noted down what are the key points we had to follow as we present. Since the topic was related to Arduino, we all made sure to have thorough research on the topic before we speak on it so that we get a better idea and learn how to present it without looking at any reference material for a long time. Then we made a rubric and strived to use it to the best of our abilities and form a consistent and valid presentation.",
    "result": "When we completed the rubric into 5 parts, each person took the initiative of working one their desired task and complete it, if they were to have doubts then we all will help as each person in the group plays a vital role in the presentation and depending on how confident we speak with clarity then we get more marks.",
    "id": "Ref_0006"
  },
  {
    "situation": "Being presented with the large load of content to learn in the Technical Drawing workshop.",
    "task_action": "Breaking down the fundamentals of each drawing style and their requirements prior to any attempt to ensure I understood their purpose and distinctive qualities allowed me to form my own understanding of the content with every session, before having ample opportunity to practise the process itself.",
    "result": "The result was incrementally furthering my skillset with every piece completed, and feeling more capable and confident with my abilities.",
    "id": "Ref_0007"
  },
  {
    "situation": "We needed to finish a student accomodation model for civil modelling and was way behind due to the responsibility put onto me and my partner.",
    "task_action": "Completing a student accommodation model, with a large group of 7 people the project should have been easily completed if tasks were assigned to each person and were 'fair' to each person. In my case, it was not and this was the same for my partner since we were forced upon the responsibility of building a whole student accommodation model that required 5 members to build it efficiently but was ultimately left to my partner and me unfairly and due to my partner and me being unable to finish the model for the assignment, the other group members selfishly tried to apply for special consideration through a supposed car crash that damaged our model making it seem like the other members also participated in the production of the student accommodation. Due to these unfair circumstances, my partner and I pleaded our case about the unfair workload and the truth about the lie for special consideration.",
    "result": "The result was being able to plead my and my partner's case about the whole situation to the tutor. Even if we may still be getting low to possibly 0 marks due to it being a group assignment, my partner and I came to a consensus that we'd rather all get 0 marks than have others freeload off our work due to unfairness.",
    "id": "Ref_0008"
  },
  {
    "situation": "We were given a set of Arduino Electrical Engineering tasks to do each week and there were about 7 each week.",
    "task_action": "We worked independently and as a group to figure out the solutions using buttons, LEDs, sketches, coding, loops, wires, and everything else available in Tinkercad Arduino. Throughout this process, we had to use math, communication, teamwork, critical thinking, and numerous other skills to achieve the results necessary to pass the course. The group I was with kept in contact with each other via text and social media to ensure not only that we were getting the work done on time but we were also making the working environment more friendly for everyone as people get to know each other better.",
    "result": "Our excellent communication and teamwork skills allowed us to create a friendlier and more comfortable environment for everyone in the group. This ensured that we also enjoyed our time in the Arduino Circuit Building.",
    "id": "Ref_0009"
  },
  {
    "situation": "I needed to brainstorm a code for playing Rock, Paper, and Scissors. With a computer.",
    "task_action": "Undergoing a brainstorming session with the instructor; viewing ideas from everybody present in the class; coming up with a draft after a lot of trial and error; testing the draft program;",
    "result": "The result was being able to come up with a code that allowed me to reach the objective set. Out of a total of 3 drafts, I decided to use the most efficient and less complicated one.",
    "id": "Ref_0010"
  },
  {
    "situation": "We were required to make floor plans in order to make our project model.",
    "task_action": "While planning floor we were not sure with calculations and shape so we went through alot of sizes and we finally made one but after some time we realised that we made wrong calculations . Thereafter, we stick back to work from basics and were able to figure out something more appropriate and better.",
    "result": "As a conclusion we were able to make a great project that satisfies all requirements and also looked good and modern.",
    "id": "Ref_0011"
  },
  {
    "situation": "I needed to complete multiple technical drawings for an assessment within a limited time frame.",
    "task_action": "Whilst going through each of the drawings that needed to be finished, I began thinking about how much time each one would require, subsequently, I ranked them in order of complexity (from least to most complex, or from least to most time necessary). This allowed me to determine which tasks would require the most time dedicated to them, and as such, approach the issue in an orderly and logical manner.",
    "result": "As a result, I was able to complete the drawings within the time frame by finishing the easier ones first. This allowed me to finish more drawings in a smaller time frame, therefore being able to spend more time on the more intricate drawings.",
    "id": "Ref_0012"
  },
  {
    "situation": "I was apart of the Software engineering workshop and was tasked with creating a scissors paper rock game, with many different variations, and needed to figure out how to mathematically determine the winner between two players. I needed to make decisions how to to complete this task whilst being uncertain of if it was possible.",
    "task_action": "To accomplish this task I met with a friend trying to solve the same problem and we brainstormed how we could achieve it, and struggled as it was a difficult task to complete. We then also researched online and visited forums to see what other people had come up with, which was helpful in alleviated some of the uncertainty as we found promising resources that we would be able to build off. We then discussed the options we could take to try and achieve the goal, and began prototyping the different solutions to determine if they were able to complete the requirements and be achievable in the time frame.",
    "result": "The result was that were able to create a mathematical equation that could determine the winner of a scissors paper rock game with an infinite number of gestures. Our brainstorming and research had left us with 3 different approaches to the problem, which we then prototyped and had to make a decision about which would most likely achieve the results we were after.",
    "id": "Ref_0013"
  },
  {
    "situation": "I am an international student living alone here without family. Therefore, for me, a lot of responsibilities now. To perform all work together I have to prioritization and concentration.",
    "task_action": "Until this time, I never lived without family. The education system here is different from my country. So I have to spend lots of time behind me studies. Afterward studying, I have to do work to pay my daily costs. While I was in my country I could only study nothing but here the situation is different. At the end of the day, there is no one to help and support me, and I even have to think about cooking when coming home. As a new international student, all these things create pressure . Suddenly, I understood that it was impossible to complete all these tasks simultaneously. Then, I decided to identify my top priority first. For example, if there is an exam tomorrow, then my priority will be the ability to focus on the exam . After the exam, I can move higher the line and focus on my job and cooking staff.",
    "result": "I've been in Australia for three months now. I found the first two months to be too challenging. But it doesn't seem to be as difficult as it was previously. Since I am skilled at setting priorities and concentrating on everything.",
    "id": "Ref_0014"
  },
  {
    "situation": "The team was struggling with communication revolving around team meetings and assignment of the minute taking and writing the reflection. Due to unforeseen circumstances, the rotation of the roles had been thrown off and uncertainty remained about who was responsible for what role",
    "task_action": "Undergoing a brainstorming session; forming a small working group with the problem statement clearly articulated and using the gallery method of brainstorming we devised several viable options. Subsequently, we evaluated each of the suggested options and rank them in order of importance, based on the parameters (such as weight, complexity, and manufacturability). After intervention from our tutor and a unified team understanding of the improvements needed to be made, the team organised for two people to be given their respective roles of writing minutes and the reflection with additional time given immediately after the Monday class to address the specific topic of reflection and the quality of the minutes.",
    "result": "The result was we were granted the leniency to resubmit our previous weeks reflection and improved upon some of our previous marks. We also had a more structured understanding of who was responsible for what role leading into this week.",
    "id": "Ref_0015"
  },
  {
    "situation": "We had a group project in high school in which we had to make a presentation and use the limited resources given to us to create a pop up project of the solar system. We had one week to complete it and were in a group of 2. However, I had been very sick/ill that week and my partner wasn’t that enthusiastic or motivated to complete or do the project, however he did say that he will design the pop-up art of the solar system. Long story short even though I was sick and didn’t attend school for that whole week I had done some of the work at home on the information of each planet and the solar system that was going to be included on the pop-up art. However, on the day of the presentation the partner I had been with had done nothing. Luckily for us we were the last to present and the teacher had given us some paper, colours and other equipment to quickly formulate our project, although we had little to 50 minutes to get it done and present it.",
    "task_action": "We had to be quick and intelligent with our decisions as we had short amount of time on our hands. We had split the task into two sections, my partner worked on the design of the pop up art and myself worked on finishing up on the information of the pop-up art. However, we realised we needed to work on the project (pop-up art) itself as without it we wouldn’t be able to present a project at all. I made a vital decision to help to make the pop-up art as it took longer than expected. The materials the teacher had given us weren’t the best but we had to make do with it. Once we finished the design of the project my partner and I quickly copied down the information I had gathered online on the pop-up art, we had around five minutes to do this, and there was a lot of information to copy down. Somehow, we had completed the entire project just under 50 minutes due to strategic planning and working hard.",
    "result": "The result was being able to complete the project under time restriction and limited resources having to strategically resource management. Even more surprisingly was how well we worked together due to this adversity, it gave us even more of a reason to complete the project and to do better and that showed in the results/feedback that were given to us a few weeks later in which our project had the second highest mark in the class.",
    "id": "Ref_0016"
  },
  {
    "situation": "We were required to plan and construct a model of student housing on the Macquarie campus as a group, following a criteria of needs including communal gathering spaces, housing, bathrooms, laundries etc.",
    "task_action": "The task required us as a group to effectively time and resource manage multiple different assignments, including a model, a report, and a presentation. In order to do this, it was integral to properly communicate and split the workload amongst each member in order to finish all required tasks. Subsequently, we all made sure to keep in touch outside of class via messaging and collaborate in class to ensure that all members were aware of what was required of them so that everything was finished within a timely manner. This also extended to the resource management in the construction of our model, as we planned our build with limited materials.",
    "result": "The result was being able to work cohesively in a time efficient manner to complete all tasks including the report, presentation, and final model. This ultimately enabled us to manage all our resources and complete all tasks for their respective submissions.",
    "id": "Ref_0017"
  },
  {
    "situation": "We needed to draw a series of objects with Multiview projections using the appropriate scale.",
    "task_action": "After planning out and selecting which object I would be drawing, I had to draw the object using the appropriate scale. Doing this initially, I struggled with grasping the concept of multiview projections and had to erase my work and start again as I had messed up the order of the multiview drawings. To subsequently fix this, I asked for help which I was helped with, from this advice, I was able to finish the drawings using the correct scale, dimensions and parameters.",
    "result": "The result was I was able to successfully finish the initial drawing using multiview projections and subsequently complete the next series of multiview sketches.",
    "id": "Ref_0018"
  },
  {
    "situation": "As an Engineer, \"creative thinking\" is essential. The ability to think creatively and effectively communicate potential possibilities is a valuable asset in any professional setting. These are essential skills for innovation, problem-solving, and project progress. \"We came together to discuss the most effective way of utilizing this tool for our ongoing RGM project.\"",
    "task_action": "\"Thinking Creatively and Communicating Possibilities\" Integrating this tool into our RGM project requires a strategic approach that encourages innovation, collaboration, and effective communication. Firstly, we ensured every team member understood the problem from multiple perspectives. Each member was tasked with gathering and effectively communicating information on current solutions, limitations, and potential risks. Each team member presented their solution, using presentation and visual aids to communicate possibilities effectively. We also included how the solution innovatively addresses the project challenges.",
    "result": "After brainstorming sessions with team members, we finally refined and narrowed down some ideas based on feasibility, impact, and relevance. The team has innovative solutions that can achieve some goals to deliver the project on time. We divide them into parts to distribute them among team members for further development.",
    "id": "Ref_0019"
  },
  {
    "situation": "I was in one of several groups in a Maths competition in which we had to solve questions of varying difficulty for a prize consisting of a basket of sweets.",
    "task_action": "We as a group selected several questions of varying type and difficulty, and then attempted to solve them separately within two minutes. After the two minutes were up, we put together our answers and determined who was more suited to specific types and difficulties, and split up the work accordingly.",
    "result": "The result was that we were able to work with increased efficiency, with multiple questions being solved at a time by the person most capable of solving them quickly and correctly.",
    "id": "Ref_0020"
  },
  {
    "situation": "I Needed to complete my ENGG1000 machine workshop project (a steel toolbox) by the deadline in despite of making a mistake while cutting in the second week.",
    "task_action": "When I incorrectly used the guillotine on my first cut I immediately thought I had made my steel sheet redundant as it had been cut in half, along the wrong line. I utilised my resource management skills to redraw my pieces onto the now two smaller sheets of steel I had. In doing this I was able to salvage 4 of the 5 required steel panels from my sheets and the other from the scrap bin. Throughout the rest of the project I was very affective with my time management and planned out every step I needed to complete each week to meat the deadline, in despite of my mistake at the beginning.",
    "result": "The result was I ended up finishing my toolbox a week prior to the deadline as I was able to often complete more than what I had planned in weeks prior due to a more affective use of time management.",
    "id": "Ref_0021"
  },
  {
    "situation": "I need to be able to complete all of my technical drawings in the allocated time frame",
    "task_action": "every week, we are given 3 hours to finish each lesson. These 3 hours are very important, because we are given special tools that allow us to draw with consistent angles and lengths. Without these tools, it is almost impossible to draw up to standard, meaning I can't finish these drawings outside of class time. I prioritised which drawings would be harder to do without the special tools provided. for example, Isometric and Oblique drawings had a very high priority, since the need to be drawn at very specific angles, which I can't do with the tools I have at home. Next is the technical drawings, since everything has to be drawn perfectly vertical or horizontal. These have a lower priority because I can do touch-ups and small lines by lining up a small triangle ruler with my page at home. Finally, the lowest priority drawings are perspective drawings. Vertical and horizontal lines can be done as mentioned before, and are much rarer. All of the other lines require no tools except for a basic ruler making them less risky to do at home. After I prioritise my drawings for the day, I allocate no more than 1.5 hours per drawing. If any take longer than that, I'll skip them and try finishing them at home.",
    "result": "A total of 19 technical drawings completed and submitted before the due date.",
    "id": "Ref_0022"
  },
  {
    "situation": "I wanted to design, manufacture and program a macropad for my personal computer.",
    "task_action": "Over the course of the project I needed to find solutions to design bottlenecks, manufacturing requirements and design simplification. I came up with new ways to layout components for optimised space efficiency while maximising usability. I created unique solutions to casing mechanisms such that no screws were required in the assembly and found ways to implement 3D printing for every non-electronic component.",
    "result": "By the end of the project I had completed a working macropad which could be reprogrammed to perform functions on keypress, and created many innovative solutions to improve efficiency, ergonomics and aesthetics in designing.",
    "id": "Ref_0023"
  },
  {
    "situation": "I needed to learn how to draw in multiple different views and angles so as to achieve an efficient understanding of the object for planning and blueprinting. I also need to accurately draw in the correct scales.",
    "task_action": "By listening to my tutors and watching the explanatory videos on iLearn I gained comprehensive knowledge on how to draw in isometric and oblique view and to scale the drawing correctly. Subsequently, Multi-view drawing and dimensioning was also further touched upon to increase the accuracy of my drawing of the objects.",
    "result": "The result was being able to draw correct scaling and in multiple views as well as being able to accurately write in dimensions.",
    "id": "Ref_0024"
  },
  {
    "situation": "I needed to complete Arduino tasks that I was unfamiliar with and did not know how to complete.",
    "task_action": "Whilst going through the incomplete tasks, I decided to make a list of things I needed to ask my tutor about to effectively complete. I also made a list of things I could do if I put in the time. I was determined to finish the tasks to the best of my ability in order to get the highest mark possible.",
    "result": "Despite the limited time, due to other assessments for other units I had to complete also, I managed to complete most of the tasks to a high quality. This would not have been possible had I not used the resources available and had a sense of urgency.",
    "id": "Ref_0025"
  },
  {
    "situation": "Towards the beginning of creating our individual Rude Goldberg Machine components, I needed to think of how I can create my components to the best ability. This required assessing the uniqueness, reliability and risk associated with each action of my RGM and relating back to the RGM goal and theme.",
    "task_action": "I had focused on vigorous testing and evaluation of designs and prototypes of each of my actions. Along with this, I recorded data of testing the components, improving upon their reliability of the RGM actions after each week. I also would analyse the successes and failures of the actions and creatively find solutions to the designs and test them. Regarding the RGM’s theme and our main goal of throwing a plastic bottle into a bin, I communicated the idea of integrating ‘repurpose, reuse, recycle’ to the team to go along with the main theme of recycling.",
    "result": "The testing results were very clear and concise to communicate my RGM test data to my team which helped create better presentations for all team members. It was easy to see the creative changes in design as the week’s progressed, with the reliability of tests increasing because of this. I found the most beneficial process was to understand the failures in design and finding ways to manage that. Communicating different ideas was possible as we could communicate using our whatsapp group chat to brainstorm and solve any issues that arose. PERSONAL FEELING/REFLECTION: As the group and I would solve issues with our individual RGM components, it would be very fulfilling to help others and work as a team to eventually come up with a finished project. LEARNING: Reflecting upon how we went about our component design, prototype, and creation stages, I feel that we could have been more time efficient as sometimes the group had issues with finishing the presentation slides a bit late in the week which from personal experience, would build pressure to the presenter for the week and make it a less effective and stressful situation. Although, communicating with setting time-constraints for each of our final RGM component videos, we will have ample time to edit our video and have more time to focus on the big week 13 presentation.",
    "id": "Ref_0026"
  },
  {
    "situation": "During the HSC, i had three of my tests at the start of the second week providing me with limited studying time between each test.",
    "task_action": "Due to the limited timeframe, I assessed my previous marks and grades for the subjects and prioritised the order in which I should study the subjects based on my confidence and knowledge within each subject. Before the intensive week of testing, I had a free week, allowing me to allocate my study time over 7 days. I found legal studies to be the most difficult of the three subjects, followed by Visual Arts and Maths. I allocated most of the time towards legal studies, as my ranking was at the bottom of the class.",
    "result": "After studying intensely for Legal Studies, I found the test incredibly easy and achieved first in the class. Furthermore, as I was more confident in my other subjects, I still obtained a great mark, improving my overall results by focusing on my weaker subjects.",
    "id": "Ref_0027"
  },
  {
    "situation": "In the ENGG1050 week four workshop, I was required to present my group’s problem definition to my tutor group.",
    "task_action": "Using my group’s Miro board as a written and visual aid, I explained our client scenario, spoke about some of our metrics for measuring success and failure, and detailed the different constraints which pertain to our project. I also gave a brief run-through of the incomplete draft chain of events our group had devised so far.",
    "result": "The result was an approximately 5 minute presentation delivering a summary of our problem definition and draft conceptual design to my tutor and peers.",
    "id": "Ref_0028"
  },
  {
    "situation": "At work, I was tasked with distributing the bread orders. Unfortunately, the previous employee responsible for the bread orders left behind a convoluted list that was difficult to follow. This resulted in me having to find a more digestible way for myself and my coworkers to follow the list.",
    "task_action": "I studied the list in order to pinpoint the relevant information and customer details. Once acquired, I brainstormed different templates to help display and communicate the information in a more organised manner. This was best done by focusing on certain key parameters; such as alphabetical order, frequencies of orders, and priority.",
    "result": "The result was the creation of a formulated list of customer details (written by hand) that my coworkers ultimately found more comprehensible than the original, which allowed us to be more efficient as a team.",
    "id": "Ref_0029"
  },
  {
    "situation": "I needed to devise a way of optimizing my time spent at university and at home towards my study on a budget. I have a Microsoft Surface Studio 2 desktop computer at home but when I was away from my desk I used to spend time on my phone trying to look at course work but couldn't read files properly on a small device. Sometimes when I was feeling tired and working straight off my bed I would end up listening to music on my phone without studying because I wasn't feeling like working behind my desk. I also needed a bigger device to communicate with Lecturers/Tutors in my course.",
    "task_action": "Undergoing a brainstorming session I devised several variable options. 1. To purchase a Microsoft Laptop studio or 2. To purchase a Samsung Galaxy Z Fold 4",
    "result": "The result was I Purchased a Samsung Galaxy Z Fold 4 and was able to utilize my time more efficiently at a cost of around $3000.",
    "id": "Ref_0030"
  },
  {
    "situation": "* Recently, I went Scuba Diving as a type 1 diabetic. This was not my first time diving with diabetes, and at the beginning of the dive I gave a small presentation about this. I talked about what it meant to dive as a diabetic, including the potential risks and what I would need from people in case a situation arises. However, during the dive a complication arose due to my diabetes. The group I was diving with felt confused and unprepared, they were unsure of what they should do. This made me realise something, that I didn’t do an adequate job informing people of their role to play in case of an emergency. I needed to prepare and script a better presentation, to explain my diabetes to my dive partners.",
    "task_action": "* A close friend of mine is one of the best cave divers in the world. He put me in touch with one of his students, another type 1 diabetic. We sat on a phone call for about 4 hours, brainstorming all of the potential problems I could have underwater due to my diabetes and what those problems would mean for me, for the people I’m diving with, and how those problems would be managed or mitigated. Once we came up with that list, we worked out which of those problems I could manage on my own, and which of those problems required help from other people. From there, we created clear and concise explanations, including props and images, to explain only the problems that would require help from other people.",
    "result": "* We came up with a new presentation, one which did a much better job of preparing people. We did this by explaining the condition, what it means for me as a diver, the important hand symbol for diving with diabetes and what it means for a dive, the potential things I need from people, and stressing that certain problems just need time for me to work through them on my own, and that if I require assistance I will signal people for it. Using this method, I was able to create a much more effective presentation. I tried this out recently and did a mock simulation of a diabetes problem underwater, and no one from the diving group was confused or felt unequipped to handle this situation. This presentation was a success.",
    "id": "Ref_0031"
  },
  {
    "situation": "The unit ENGG1050 is a fully online unit and it was my first time , I was studying a full unit online. So, it seemed difficult to me to communicate with my teammates online. Also, me and my teammates were confused in choosing software for presentations.",
    "task_action": "In our first session of class, I found that all of my teammates were friendly and we decided to make a whatsapp group for communication. Then one of my teammate shared a google document , this document purpose was to pick a common time for online team meetings , we all coloured timings red in which we were busy. At last for presentations, we consulted our tutor to decided which software is best.",
    "result": "As a result, we found a common time at which all were free for online meetings and our tutor referred us miro software and it's really best for making presentations and for communication.",
    "id": "Ref_0032"
  },
  {
    "situation": "ENG1000 skill 1 Arduino final submission required the whole class to replicate a 4-bit binary adder. The adder needed to add numbers based on 2 seperate binary inputs and then displayed on an LCD screen. This task involved a high amount of advanced coding/circuit-building skills that were beyond the normal task level. These components and skills required appropriate prioritisation and focus so that the product could be presented in time.",
    "task_action": "Prioritisation is essential in project-based assessments because it directs an individual's effort to what is most needed and important. A great guideline to structure the priorities in our project was the marking guideline. The markers would allocate to us different marks depending on what part of the project we finished. The plan was to focus primarily on the highest-paying marks first and then the seperate lower marks. A huge prioritisation in this process involved learning the binary system and its code. The focus would be directed on how to make a system code that would read the binary and then add/display it on LCD and LED lights. Because coding is a complex subject, I prioritised my focus on researching and developing code to suit the binary.",
    "result": "Prioritising the binary code allowed me to create the foundational adder system that was needed for the project. Understanding the code allowed an extended time to work on additional marks of the project (e.g. the circuit, the LED displays).",
    "id": "Ref_0033"
  },
  {
    "situation": "Throughout the now 11 weeks of the ongoing RGM project my team and I had developed and implemented a communication structure that was effective and worked well for everyone in the team. The structure has aided myself and my team in delivering information of what we must get done each week, which ongoingly helped us to succeed in completing the Rube Goldberg Machine project of a coffee machine.",
    "task_action": "From start of the entirety of the team project. My teams and I began discussing how and what communication platform the team would be using as the main method of communication for the throughout the completion of the RGM project. I had discussed with my fellow group members what common communication we used in common, that we could then use throughout the RGM project as our main tool/method of communication. We discussed options such as Zoom and Discord. We finally determined to use discord for our communication platform. Discord provided many advantages over zoom such as having a messaging feature that allowed to scroll back in time to view older tasks and information shared, whereas zoom only has a chat function within meetings that member must connect to, to chat. Discord allowed communication between myself and other team members throughout the 11 weeks and was not restricted to having everyone available at one time. Additionally, discord also had a voice chat feature which allowed my team to have meetings to discuss the project. The utilization of Discord was an initial step in establishing a good communication structure. With Discord, ideas and weekly briefs of tasks outlines could be discussed and completed, and distribution of tasks and roles was done so using discord. From week 1-2 my team and I had also determined what days and times we were all available for weekly meetings, which we decided upon Mondays as the ideal meeting time, and later this date changed to Thursday due to the busy schedules of individual members. This was another element that formed the communication structure for me throughout the entirety of the RGM project.",
    "result": "Having established an effective communication structure early on in weeks 1-2 allowed quick messages and information to be shared between all members throughout the 11 weeks so far. It enabled the sending and delivery of ideas from the initial aim of our RGM to the preliminary to conceptual then later detailed design and final preparation and combination of individual RGM elements.",
    "id": "Ref_0034"
  },
  {
    "situation": "We needed to prepare an oral presentation to describe our Rube Goldberg Machine.",
    "task_action": "Undergoing a brainstorming and critical thinking session; we decided which three team members will be the most suitable for the presentation and we divided the contents of the presentation among the presenters. Presentation slides and a speech for each presenter was also made. A lot of practice presentations were done in front of the other teammates and each teammate gave their reviews which were used to refine the presentation. Each part of the machine was described inside the presentation along with accurate descriptions about testing, improvements, precautions, and our learnings so far. The introduction included a innovative sales pitch and our problem definition and the presentation ended with a conclusion that included our final thoughts. The contents of the presentation were selected based on importance and relevance.",
    "result": "The result was being able to produce a desirable presentation for our Rube Goldberg Machine which was relevant and discussed everything we wanted to about our RGM.",
    "id": "Ref_0035"
  },
  {
    "situation": "In our software engineering course, we needed to brainstorm a design mechanism for unloading cans from a robot onto a shelving unit.",
    "task_action": "We organized a brainstorming session, forming a small working group with a clearly articulated problem statement. Using the gallery method of brainstorming, we generated several viable options. We then evaluated each suggested option and ranked them in order of importance based on parameters such as weight, complexity, and manufacturability.",
    "result": "We successfully selected a design solution from the six options generated during the brainstorming session. We divided the required tasks among team members for further development. REFLECTION: This experience significantly enhanced my communication skills in a software programming context. By articulating the problem clearly and using structured brainstorming techniques, we fostered an inclusive environment that encouraged diverse ideas. Evaluating and ranking the options required clear, concise communication and collaborative decision-making. This process not only improved my ability to convey technical information effectively but also underscored the importance of teamwork and structured communication in achieving successful project outcomes.",
    "id": "Ref_0036"
  },
  {
    "situation": "We needed to verbally address the audience on a particular topic by presenting it and providing a cohesive argument or credible information.",
    "task_action": "Whilst practicing the presentation, focus was made on our eye contact skills, presented body language and emphasis on speaking clearly. Subsequently, we evaluated our performance on each of these skills in order to improve them, based on engagement, confidence and intonation.",
    "result": "The result was being able to practice and enhance each of these skills to provide a cohesive but engaging presentation to the audience, providing our credible evidence and confidence on the topic at hand.",
    "id": "Ref_0037"
  },
  {
    "situation": "During the initial stages of team development, it was crucial for us to find an effective communication platform alongside developing a teamwork strategy and honing our communication skills. The teams were allocated members virtually, and the unit was designed that way.",
    "task_action": "Having talked in the first workshop meeting and learning a little about each other, we were able to break the ice. Following that, a communication platform needed to be sought via which we could comfortably articulate our thoughts and ideas. Although there were several viable options, Discord seemed to be the most compatible with the team members. Having this comfortable environment promoted communication, which is much needed for teamwork and team building. Another aspect of a functioning team is delegating tasks. This helped members identify their specified role and create a sense of responsibility to fulfill that requirement.",
    "result": "We were able to develop a functioning team where the members are fully aware of their roles and responsibilities. By contributing to our strengths, we were also able to cover each other's weaknesses and ultimately complete tasks with efficiency.",
    "id": "Ref_0038"
  },
  {
    "situation": "During this semester I have had difficulty with appropriately managing my time. Specifically, in regards to balancing my part-time work with studying. At the beginning of the semester I was disorganised and working 35-40 hours a week. This caused me quite a bit of stress, which is reflected in my grades.",
    "task_action": "I re-evaluated my priorities and reflected on how I could realistically manage my time and resources (e.g. money). To do this I drew up a study plan which included a weekly checklist of the most important tasks for each of my five subjects. I also used a calendar board to visually display all due dates as well as when I should begin tasks, such as, assignments. To help me manage my resources I created a budget accounting for my major spending points, how I could reduce them and thereby how many hours I really need to work each week. Finally, I spoke to my manager to request less hours so I could focus on university.",
    "result": "The result has been effective to varying degrees of success. The visual calendar has successfully helped me submit assignments and prepare for tests. Additionally, the calendar helps me manage my time in all areas of my life, not just university related. However, less successfully is the amount of hours I work. My current place of work is very short on staff and as a result employees are pressured to work more hours. This is still an aspect of my time management that I am still attempting to improve.",
    "id": "Ref_0039"
  },
  {
    "situation": "At the age of 17, I want to become a health provider, working in the NDIS industry or age care services. I had placed a goal in which I wanted to achieve but I understood the responsibilities it would require to take. At the time I was in yr11. I did my research and would often call up the NDIS and understand the process into becoming a registered provider. I had to prioritise a lot of my holidays and weekends understanding the process. Prioritization and focus is a skill that everyone should develop over there course of experience in the workplace. Prioritization is understanding the urgency of the matter and focusing on how to find a solution.",
    "task_action": "I had faced a lot of criticism from other Registered providers, they would often make it difficult for me with either providing me with incorrect information or false guidance. Having very limited qualifications, I had signed up to some online course which provide you with qualifications within short periods of time. I was focused in what I wanted to achieve and put a lot of dedication and hours doing research. I had to do a background check, and a few other checks to be deemed safe to work in the industry. I would stay up late at night prioritising family night doing research and gathering of my documents. With several restless nights I felt like things were getting nowhere. I was under qualified and the qualification in which I provided where not enough. I was focused and dedicated, I didn’t want the opportunity that I had go past me. I came up with a idea of which I would hire staff that which were qualified to work for me. It came to thought that I can ask for assistance from my uncles and aunties to provide there documents in which I can receive the registration approval. My dad has 11 siblings and all of which work. A few of my uncles work In the hospital and manage the ICU sector, a few of my aunties are teachers and there qualifications are suitable for the registration groups in which I applied for. The process took me over 1 month to gather all the documents. I had to priorities some of my time for my preliminary exam which I had in year 11 and that went on for around 2 and a half weeks. Prioritization and focus has become a part of a daily lives, which every decision we make requiring some form decision making. As I grown up, I understood that we have to priorities a lot of things in order to accomplish a dream and a goal. For me a dream was opening up a business, establishing a business wasn’t a easy process and it had required me to priorities a lot of my family time to become a provider. Although a lot of people still mention that I have university to look out for and I’m still young, then I should have the option of enjoying my time while I’m at it.",
    "result": "I believe to overcome challenges we must understand the objectives and focus our goals on what is more important. This is further reinforces by the “Eisenhower Matrix”. This form of prioritisation method is a task management method which I often use to maintain my day to day tasks. It is a form of planning method, you construct your duties into 4 categories and they go as followed, the tasks you do important and need to do first, the second section is for tasks which can be completed after or later on. When the important tasks are completed. Section 3 is tasks you require assistants with, so if someone can give you a hand in or knowledge to completing a task and lastly section 4 is deleting tasks which have been completed. This process helped me schedule my tasks into the 4 categories, this has enabled me to maximise my time spent on important tasks which are required to be completed leaving the non-urgent tasks to the end. At the end, after a restless 6 months going in and out of meetings, we had finally received the company registration. My family and I agreed that my dad will be the director in the business as he will be running for majority of the time while I complete my study. During the process I’ve learnt that the process of prioritisation and focusing is a fundamental part of our lives, taking on more responsibilities are we continue moving forward, we are required to often reflect on our progress and what we consider as our priorities. It enables us to create a great work balance between our work life and our family life, the use of “Eisenhower Matrix” allows me personally to reflect on my progress and make adjustments suitable to achieving that goal.",
    "id": "Ref_0040"
  },
  {
    "situation": "We were tasked with completing a variety of basic coding and circuitry problems with an Arduino Uno board and its corresponding integrated development environment. Complementary to this, we were also asked to create a LinkedIn page and talk to our surrounding peers and to expand our network.",
    "task_action": "Everyone had access to a pdf file containing the problems and a supplementary guide on basic nomenclature of the key parts of the Arduino board and tools we were to use. Prior to completing the task we briefly set up a LinkedIn account and shared accounts with those around us. The tasks itself required us to: * _Use 4 LEDs to build a circuit which blinked one LED at a time consecutively_ * _Use 10 LEDs to build a circuit that counted through each one like numbers, counting first evenly and then oddly and then in prime order_ * _Use 4 LEDs to create a circuit that will count to 15 in binary_ We had a total of three hours to complete these tasks, with each task acting as a precedent for the knowledge required to complete the next. As there were varying degrees of knowledge with the Arduino board and for coding in general there was a lot of discourse amongst the class to try and work through the problems.",
    "result": "The result left everyone with a working circuit board tuned to solve its corresponding problem which was then marked off by the tutor and critiqued.",
    "id": "Ref_0041"
  },
  {
    "situation": "When constructing our RGM events, we had some difficulty with creative designs, and communicating possible solutions for our individual events.",
    "task_action": "To overcome this problem, we first consulted with the rest of the team. In a team this should be the first step when you are presented with any problem. Referring to your team for help is useful for building greater teamwork, communication and problem solving skills. This method is not without its flaws, as creative solutions can be difficult to physically develop into a functional product. For certain problems it can also be very difficult to explain what the root cause of the problem is, even with the benefit of communication software like chatrooms and phone calls. Each team member is constructing and conducting tests individually in their own workspaces, and it can be very hard to offer solutions when each team member can't physically see the construction and determine the cause of the problem. After consolidating with the team, if the issue persists, it is also helpful to search resources online for similar problems or alternative methods for solutions.",
    "result": "The result from communicating solutions with team members is a stronger team. Sharing ideas with other people is a useful way to expand creative thinking skills, and develop more creative solutions to problems. The longer a team works together, they tend to develop similar ways of thinking and generating solutions, which helps in understanding the problem a team member is proposing. It then becomes easier to conceive a solution in a way that the team member will be able to understand and succeed upon. Online resources can help the team member find inspiration to potentially solve their problem or other collective issues the team may have. Online resources (e.g. videos) provide the ability to visualise a similar solution to your given problem. This will make it easier for the team member to solve their problem, developing their problem solving skills further.",
    "id": "Ref_0042"
  },
  {
    "situation": "A task required us to derive an algorithm capable of determining the winner of a standard game of paper, scissor, rock, spock and lizard. Furthermore, the algorithm must be able to accomodate for an infinite array of possible hand gestures.",
    "task_action": "To start deriving the algorithm a pattern needed to be conceptualised. This was achieved by thinking of gestures as numerically values such as rock is 0 and paper is 1 and so forth. Then by finding the difference between the human and computer gesture, for example scissors vs paper as 2 - 1 = 1. To better understand the pattern, I organised the data into a table for analysis. In cases where the difference resulted in a negative value I adjusted it by adding the total number of gestures the user chose for that specific game. This process revealed a noticeable pattern: even numbers indicated a human loss while odd numbers indicated a human win. Consequently, the algorithm used modulo and conditional statements to determine the winner of the game.",
    "result": "The result was an algorithm capable of choosing the winner between human and computer gestures, even in cases involving large sets of gesture (to infinity).",
    "id": "Ref_0043"
  },
  {
    "situation": "My schoolmates and I embarked on the challenge of orchestrating a flawlessly synchronised marching routine for our annual school competition. This endeavour undeniably called for intricate teamwork, effective communication and seamless coordination.",
    "task_action": "I facilitated a comprehensive group meeting to brainstorm ideas and allocate responsibilities, resulting in the formation of smaller teams among our 500-student batch, each led by its own leader. After in-depth strategy discussions, we swiftly transitioned into action. Recognising the need for rigorous practice, we immediately coordinated practice and additional sessions, maintaining this rigorous routine for two weeks leading up to the final competition.",
    "result": "Our dedication to teamwork and clear communication translated into a highly coordinated march, where every limb moved in perfect harmony with the guiding drumbeat. This relentless effort culminated in us proudly claiming the trophy for the Best March of the year.",
    "id": "Ref_0044"
  },
  {
    "situation": "After individual introduction, our group consisted of very like minded individuals based off of our DISC and OCEAN results. This resulted in a limited amount of diversity affecting our creativity, understanding how to tackle an issue from multiple views & overall forming a strong link between each individual as we all had characteristics of seeking guidance rather than giving it.",
    "task_action": "As weeks passed, all members became more comfortable with sharing their opinions which gave me and two other members with more perseverance an opportunity to analyse which member needs guidance in different aspects of our Rube Goldberg Machine assignment. Pin pointing our weaknesses helped us lead a systematic approach towards who could pick up what would be dropped off by someone else. For example my strength as chairman and leading makes up for one of our more reserved members who claims to struggle in that department. in addition, to prevent unfair loads of responsibility based upon our strengths we take a moment within our extra meeting to work on each others flaws and address where a member could improve and how they could achieve development.",
    "result": "Out of the action taken, our team has been able to correlate & take advantage of our individuality & create strong links between each other. As levels of communication improved the groups creativity has had the opportunity to shine, further presenting the RGM to become a representation of each member, especially considering each problem faced became near inferior as the team worked in unison to provide an effective solution.",
    "id": "Ref_0045"
  },
  {
    "situation": "Our group was given a project with multiple tasks (report, model and presentation) that have different due dates.",
    "task_action": "Evaluate the amount of time given for each task; evaluate the times where each group member is free or available to work on each task; prioritise each task based of importance and due dates; allocate time to complete task within schedule; have checkpoints throughout the given time to ensure progress of each task. Due to the limited time we had to construct our model as this could only be done in class, most of our in-class time was spent on the model while our time spent outside of class was used to work on the report and presentation. The report (what I was tasked to do) was divided into its sections which allowed me to create 'checkpoints' that I could use to track progress to see whether I was on schedule or behind schedule.",
    "result": "This allowed me to see how much time our group has to complete each task, ensure that I will have enough time to work on the project and be able to complete the project within the given time.",
    "id": "Ref_0046"
  },
  {
    "situation": "We needed to present a presentation on the importance of cyber security in the modern world and each member has to speak for 5 minutes.",
    "task_action": "We first focused on doing some research on the topic so we can get the basework needed for this topic. After that we divided the focus areas between 5 members of the group so that each member can speak for one minute. Since the topic is broad, each member has to make sure to mention only the main key points hence they don't cross the time limit for their part of the presentation. Furthermore, we also make sure that every member that speaks has some correlation about the topic which the previous speaker conveyed so that their is a smooth transition hence all the listeners can understand well.",
    "result": "The result was completing the presentation on time and each member playing a crucial part in presenting well.",
    "id": "Ref_0047"
  },
  {
    "situation": "As a team , we encountered significant issues with managing our project timelines and resources. Tasks were frequently delayed, and resource allocation was often inefficient, leading to overworked team members and unmet deadlines. This situation was creating stress within the team and dissatisfaction among team members and our tutor.",
    "task_action": "Our task was to improve our time and resource management practices to ensure projects were completed on schedule and resources were utilized efficiently. The objective was to enhance team productivity, reduce stress, and improve tutor satisfaction.Subsequently, * Identified key pain points and areas for improvement * Provided ongoing support and addressed any issues that arose during the transition.",
    "result": "This experience underscored the importance of structured time and resource management practices in achieving project success. By implementing the right tools and processes, we were able to enhance productivity, meet tutor expectations, and create a more positive and efficient working environment.",
    "id": "Ref_0048"
  },
  {
    "situation": "The aim was to build an aluminium toolbox with precision, assuring little material waste and early completion.",
    "task_action": "First, I thoroughly planned the project, drawing up a complete blueprint with exact measurements for each component. Despite my meticulous preparation, I made a mistake during the cutting process and cut one of the pieces too short. Recognising the error, I quickly stopped the procedure to analyse the situation. To fix the issue, I saw I needed to cut out a new piece to replace the one that was too short.I took quick action, measuring the right proportions to ensure no further errors, and carefully cutting out a fresh piece from the aluminium sheet. Throughout the procedure, I remained focused and precise, emphasising the significance of double-checking measures after learning from my error.",
    "result": "Despite the initial setback, I was able to replace the wrong piece with the newly cut one without any delay. Following that, the project went successfully, with the toolbox completed on time and by all design parameters. This experience taught me the value of attentiveness and attention to detail in precision crafting, which in turn improved my time and resource management skills.",
    "id": "Ref_0049"
  },
  {
    "situation": "WE NEEDED TO CREATE A BINARY CALCULATOR USING AN ARDUINO CIRCUIT ,LEDS,BUTTONS, AND A LCD DISPLAY. EACH BUTTON SHOULD TURN ON ITS RELATIVE LED TO DISPLAY A NUMBER IN BINARY NOTATION , AN EXTRA BUTTON IS PRESSED TO STORE THE FIRST NUMBER, THEN AFTER ANOTHER NUMBER IS ENTERED PRESSING THE BUTTON ADDS THE NUMBERS THEN DISPLAYS THE SUM ON THE LCD DISPLAY AND IN BINARY NOTATION ON THE LEDS",
    "task_action": "TO SOLVE THE CALCULATOR PROBLEM, I APPROACHED IT FROM MULTIPLE ANGLES, BUT THE BEST SOLUTION WAS TO BREAK IT DOWN INTO MULTIPLE PARTS. THIS INVOLVED CREATING MANY SEPARATE CIRCUITS. TO KNOW WHAT CIRCUITS TO BUILD A BRAINSTORM WAS DRAWN UP SHOWING ALL THE SEPARATE FUNCTIONS THAT THE CALCULATOR HAD TO ACHIEVE.THEN THESE FUNCTIONS WERE ASSIGNED TO SMALLER CIRCUITS THAT COULD BE INTEGRATED INTO A LARGER SYSTEM. EXAMPLES OF THE SMALLER INDIVIDUAL CIRCUITS ARE AS FOLLOWS BUT LIMITED TO 4 BUTTONS WHICH TURN ON THEIR RESPECTIVE LEDS, BINARY TO DECIMAL CONVERTER AND SUM OF TWO NUMBER CIRCUITS. AT THE END OF THE CREATION OF THESE INDIVIDUAL CIRCUITS THEY ALL HAD TO BE COMBINED TO CREATE A FULLY FUNCTIONING BINARY CALCULATOR.",
    "result": "THE RESULT OF CREATING A CLEAR PLAN TO DESIGN THE CIRCUIT ALLOWED FOR AN EASY CREATION AND IMPLEMENTATION OF CIRCUITS WITH RELATIVE EASE , ALLOWING FOR THE CREATION OF THE FULLY CREATED END PRODUCT WHICH MEETS ALL OF ITS SPECIFICATIONS AND REQUIREMENTS.",
    "id": "Ref_0050"
  },
  {
    "situation": "Throughout week three and four, we discussed potential designs to use for our Rube Goldberg Machine and the quickest way to get a preliminary design.",
    "task_action": "During these two weeks, each member was given the task to research on designs for inspiration, which after they would produce their own design idea prior to the next scheduled meeting. Then as a group, we can evaluate and tweak the individual designs according to our theme and rubric.",
    "result": "As a result of this, it allowed us to produce a full preliminary design within a short time frame giving us ample time to modify if necessary. Managing our time efficiently, meant the meetings were more productive.",
    "id": "Ref_0051"
  },
  {
    "situation": "The group needed to brainstorm preliminary designs of the Rube Goldberg Machine and evaluate the feasibility of those ideas as well as determine the scope of creativity they'd allow the group to achieve.",
    "task_action": "The group conducted a thorough review of several YouTube videos featuring preliminary design concepts. This exploration served as a foundation for our creative process, inspiring us to branch out and develop our own unique designs such as the flow/transportation of water. Through personal research, the members further uncovered creative ways of approaching the machine's design, enriching our design process.",
    "result": "Our efforts enabled us to express creativity while maintaining a clear and feasible vision for the machine. We've successfully blended inspiration from various sources with our personal research, ensuring that our ideas are both imaginative and achievable within our project's constraints.",
    "id": "Ref_0052"
  },
  {
    "situation": "During week five our group brainstormed our conceptual design for the Rube Goldberg Machine (RGM) which would involve various modularized systems culminating in pressing the space bar on a laptop.",
    "task_action": "Using the problem definition from the previous group meeting, we identified the design constraints for our RGM machine: each member creates two unique events with each lasting a minimum 3 seconds, each event flows seamlessly to the next, materials are supplied using household items and the total system lasts a maximum 5 minutes. Next, we established the sequence of system in terms of member, who has initiating system and who finishes the system. Subsequently, we brainstormed various ideas and systems we could use for different events such as dominoes, pulley systems, ramps, balls/marbles, tubes, fans and so on. From there, we collectively brainstormed variations how each item/idea could be implemented in an event. Once all the suggested ideas were thoroughly assessed, each idea was ranked against different variations in terms of feasibility given time constraint, complexity, and uniqueness.",
    "result": "The result was collectively selecting 10 conceptual ideas from the list of 20 ideas brainstormed. Further, two mechanisms were given to each member depending on their assigned position within the RGM system to maximise a seamless transition between each event. This was done collectively after the team discussed and assessed each idea in various positions along the RGM machine.",
    "id": "Ref_0053"
  },
  {
    "situation": "Upon starting ENGG1050 in week 1 there were immediately some challenges faced. Given the lengthy end of year holidays, my brain was not primed for the future weeks of academic studies ahead. This of course is only to be expected, but in addition to this, I have reflected on my last year results and know that they were not optimal; there is a bit of room for improvement and I need to be prepared this semester. The writing of this assessment task has made me realise that this ‘room for improvement’ is in fact a lack of time management and organisation.",
    "task_action": "In order to make a change I decided that I needed a system in place that would work with my weaknesses so that I could focus on the actual content of this unit, and produce my best work. In week 1 there is a lot of new important information about assignments and how the unit will be structured. Due dates are not something you should rely on your brain to remember, therefore I downloaded a calendar app and a to-do list app.",
    "result": "When used in conjunction with each other, I would be able to track important dates, plan ahead and manage my time a lot more wisely. This is a huge step up from last semester where I did not have a defined and much-needed system in place; I only had a simple to-do list that I did not stick to, therefore making it a lot harder to visually track and coordinate tasks, leading to a lot of disorganisation. This semester, this system has been working well for me as I have not repeated these same mistakes.",
    "id": "Ref_0054"
  },
  {
    "situation": "We needed to create a model of student accommodation that met a specific design criteria that was provided by the client.",
    "task_action": "We formed a small group of 5 people and each member of the group created a concept model of what was going to be included on each level of the design and what the model would look like. From this point, we chose the design that we thought would be best aligned with the design criteria and have a complex exterior shape rather than a simple rectangle.",
    "result": "The result was prototyping a model that was refined from the 5 concept models. The tasks required to complete this task were divided between the members of the group.",
    "id": "Ref_0055"
  },
  {
    "situation": "In my ENGG1000 course, I was assigned the task of creating orthographic views of 3D objects, a crucial skill in technical drawing.",
    "task_action": "To accomplish this, I first meticulously analyzed the 3D models, identifying their key features and spatial relationships. Then, I began sketching the initial drafts, employing critical thinking to determine the most effective approach for representing the objects in 2D. I used projection lines and construction techniques to ensure accuracy and consistency across the various views. When faced with complex sections or uncertainties, I paused to reassess my strategy, often referring back to the 3D models to gain clarity.",
    "result": "The outcome of this process was a set of detailed orthographic drawings that accurately depicted the 3D objects from multiple perspectives. My critical thinking skills enabled me to navigate the intricacies of technical drawing, ensuring that each view was correctly aligned and proportioned. As a result, I successfully met the project requirements and received positive feedback on the clarity and precision of my drawings. This experience underscored the importance of critical thinking in engineering tasks, emphasizing the need to approach challenges methodically and continuously refine one's work to achieve optimal results.",
    "id": "Ref_0056"
  },
  {
    "situation": "We needed to brainstorm and design our final RGM project and fully build and film (record) it, as part of the final assignment.",
    "task_action": "We first attempted to build our project as a mirror image to our preliminary design but using holistic thinking capabilities we quickly identified the problems that may raise if used the same exact design. All of us were quick to analyse the flaws the flaws in the design through trial and error we adapted to our final project design accordingly.",
    "result": "We filmed all the parts with ease and smooth transitions with all the seperate events having good reliability and repeatability.",
    "id": "Ref_0057"
  },
  {
    "situation": "While making our model of student sharing accommodation , it was difficult for my team to manage time and complete model within specified period of time because of lack of time and resources.",
    "task_action": "So, we decided to borrow some of resources from our teachers and meet outside the class when we all were free ,however, it was difficult for us to meet together at one place at one time as all are busy in their chores but leaving our other tasks we met at library and started continuing our model. Moreover , we decided to divide the work between us so, that we can speed up our work. We shared the resources which we bought from teachers for making our model and we spend 6 - 7 hours that day on our model.",
    "result": "The result was that we completed most of our model on that day and finally we were able to submit our model on last day.",
    "id": "Ref_0058"
  },
  {
    "situation": "Missed Civil Modelling workshops for two weeks, making it difficult to catch up on group tasks.",
    "task_action": "Emailed unit convenor to request transfer to Software Design Logic workshop, where tasks were individual and I had prior coding experience.",
    "result": "Successfully transferred to Software Design Logic workshop, allowing me to make up for missed sessions and participate more effectively in tasks suited to my skills.",
    "id": "Ref_0059"
  },
  {
    "situation": "I needed to design a 3D model of a house with floorplans and 3D renders which match the 3D model precisely for a concept of a house accommodating the disabled and elderly.",
    "task_action": "Approaching the need for accurate design and the need for exceptional quality, I underwent a brainstorming process in which many ideas were formed over multiple days. Within those days I created lists then sketches based on the consumer’s needs, for example, large living areas and easy accessible kitchen benches for the disabled and elderly. At the end of the process a design was chosen. However, a suitable program was needed, and research was done on that. In the end a program named ArchiCAD was chosen as it fulfilled 2 of the 3 (3D rendering and floor planning) needs for the design process. As such the 3D renders and floor plans created scale for the model and allowed me to go into further detail for the physical model provided.",
    "result": "The resulting product was of a high standard of quality and provided the consumer to fully understand the design and the eventual look and feel of the home which they were considering building. The brainstorming process and research processes made the creation and application of skills to go a lot smoother than if decisions were made on the spot as the model was being built.",
    "id": "Ref_0060"
  },
  {
    "situation": "The task at hand was to create a rock paper scissors project in which I was required to learn a new programming language 'C' from scratch utilising a new IDE program, 'Replit' in order to effectively create a game of rock paper scissors with 5 gestures which was ready to be played.",
    "task_action": "Critical thinking was invaluable to this operation as an individual with limited resources and assistance. In order to figure out how to learn 'C' and how to learn to use this new IDE I had to think outside the box to answer problems that were given to each student as per the workshops each week. Utilising multiple variations of a solution as a calculated approach to solve each individual problem and thus utilising this learning in the final project. Where multiple attempts at coding each section proved more valuable as I was able to critically analyse my task requirements and effectively create solutions the conditions and variables required with my RPS game.",
    "result": "The result of utilising critical thinking is formed through my ability to analyse each problem effectively and ultimately create in depth solutions that would prove my project successful and ready to be submitted. Effectively breaking down each step in order to progress with the creation of my game.",
    "id": "Ref_0061"
  },
  {
    "situation": "Over the past 6 years I have worked professionally as a Diagnostic Radiographer across many public and private healthcare facilities. To this day I can still recollect my very first nightshift, and the experiences that I had learnt from it. Working in the Townsville University Hospital this night, I was the sole radiographer providing all the Medical Imagining services across both Xray and CT for the entire hospital. It was a busy night and at some point, I received two phone calls within seconds of each other, one was theatre stating they had an anesthetised patient on the table and needed x-rays, and the other was a MET (Medical emergency team) Call attending a patient with acute shortness of breath that needed me also. As I was leaving the workstation to change into my theatre attire, there was an announcement made through the emergency PA system “Paediatric Rapid Response to RESUS”.",
    "task_action": "I immediately called the second on-call Radiographer, explained what was happening and asked them come in. I got changed into scrubs, informed ED and the MET call team that I had to attend theatre urgently and that another radiographer would be there shortly. Once I had finished screening (taking x-rays) for the theatre case, I returned to the medical imaging department, sent the on-call radiographer home and continued the rest of the shift. Although I applied good critical thinking to able to overcome this sudden spike in the workload, I wanted to make a change, so that something like this would not happen again, to myself or my colleagues. So, I approached my team leader with my concerns about the increased workload and the pressure it has on the sole nightshift radiographer, especially the less experienced graduates (as I was). I also addressed the issue, with statistics I had gathered, in staff meetings and with the deputy director at the time advocating for increased support for the nightshift radiographer and especially for graduates undertaking nightshift for the first time.",
    "result": "At the Townsville University Hospital, I have since been the last radiographer to ever (since 2019) work their first nightshift alone. As part of my advocating for a change and the support of my colleagues, the first initial nightshift for any new staff member is rostered with a ‘buddy’, another experienced radiographer to help guide them through the afterhours procedures and processes. Although I did also advocate for a second radiographer to be rostered to nightshift indefinitely due to the increased workload, I cannot claim that I was reason that they decided to do so. COVID-19 and the increased workload that came with it was, but I supported this and undertook additional nightshifts to help the nightshift radiographer.",
    "id": "Ref_0062"
  },
  {
    "situation": "We as a group were tasked to form an effective team to create a Rube Goldberg Machine that performs a simple task.",
    "task_action": "Our group worked effectively and efficiently through forming and following roles within the team that rotated weekly. From the beginning we were tasked to take a DISC and OCEAN survey which produced results which show our own individual attributes, such as who was more of a leader and who was more of a supporter; who was more of a creative person or rather more logistic. With these results we were able to devise a rotation of roles throughout the weeks, these roles being; The \"Chair Person\" - Who would take control of the meetings that week and would be in charge of keeping everyone on track, updated and on topic throughout meetings. The \"Minute Taker\" - Takes notes and minutes of each pre-workshop and workshop meetings, and is also in charge of making the agenda for the upcoming week. Also responsible for writing but not creating the weeks reflection as the teams reflection is a group task, but the minute taker is in charge of typing out and emailing both the minutes and the reflection to the tutor. The \"Presenter\" - Creates and presents the presentation based on the topic of that week.",
    "result": "By creating these roles and responsibilities, each person in the team was able to contribute effectively and evenly throughout the weeks as each person had a chance to have their say. We as a team were able to perform our tasks mostly on time and have all contributed each our own thoughts and ideas effectively.",
    "id": "Ref_0063"
  },
  {
    "situation": "For our group project in COMP1300, we were asked to prepare a presentation on Data Breaches. Communication was a big challenge for us because we all came from different places, literally and figuratively, and we were not always in agreement when it came to certain elements of the project.",
    "task_action": "I also conducted a meeting to discuss communication and teamwork issues; I also started a WhatsApp group for real-time discussions and used Google Docs for collaborative work. We had set up regular check-ins for status & defined the roles with each member. Even, did team-building exercises to grow closer.",
    "result": "Although our strategies resulted in improved communication and teamwork, it was a process. We got the presentation done early, and we scored high, and we got to work together on a few more projects.",
    "id": "Ref_0064"
  },
  {
    "situation": "Making a toolbox, with limited resources and minimal time.",
    "task_action": "In this unit, my classmates and I had to create a toolbox, using aluminium or steel. As this workshop was taken by many engineering students from different branches, we all had to be aware of the limited resources, and that there was no room to make silly or large mistakes. Furthermore, our lessons were 3 hours long, which was split into 1 hour explaining equipment’s, work, and doing quiz, while the remaining 2 hours were used to work on our toolbox. With the limited amount of time and resources, we made sure we measured our pieces multiple times before going to the guillotine and cutting each piece of our toolbox and made sure we stuck to the schedule and the order of each instruction to build our toolbox on time.",
    "result": "The result was being able to build our toolboxes on time and make minimal to no mistakes when cutting and measuring our toolbox pieces, leaving the worry for limited resources.",
    "id": "Ref_0065"
  },
  {
    "situation": "We needed to draw technical drawings consisting of various shapes as well as 3D printed shapes which required critical thinking.",
    "task_action": "Drawing the technical drawings required measurement of objects, the use of ratios, different drawing equipment as well as different drawing techniques. Once shapes were measured, they were determined whether they needed to be upscaled or downscaled depending on the initial measurement. They were then drawn on paper in several formats such as two point perspective and Multiview. This establishes that critical thinking was needed to determine these variables.",
    "result": "The result or outcome was not only the successful illustration of the shapes but a well recognised use of critical thinking.",
    "id": "Ref_0066"
  },
  {
    "situation": "We had to schedule and distribute individual time across the week to get ready for our weekly presentation and devise/create concepts, plans and materials for our RGM project.",
    "task_action": "It was a responsibility that all team members allocated time each week to work on projects and presentations. Through team meetings, discussions, zoom meetings and phone calls we were able to commenced by evaluating the available week's timeframe, breaking down tasks for both the presentation and RGM project. A team meeting was orchestrated to define objectives and generate ideas collaboratively. A well-balanced schedule was crafted, accounting for presentation groundwork and project conceptualisation. We come up with the presentational design where each week the rotation of roles will be turned so that every week a different team member was presenting. How we kept the time management going is the we used online talking platforms like zoom, WhatsApp and phone calls to keep track of everyone availability and keep everyone updated on the upcoming meetings and allocated times. We even shared calendars so that we can know exactly we will be coming to the meeting on that certain weeks. We also had to make time throughout the week to discuss how we going to come up with our certain RGM project and how we going to enable it to work and the team encouraged a dynamic brainstorming environment where every team member felt empowered to contribute their ideas without reservation. As ideas flowed, the individual adeptly guided the discussions, helping the team to identify the most promising concepts. These concepts were then subjected to a rigorous evaluation process, assessing factors such as feasibility, innovation, and alignment with project goals. Through depth discussions and analysing how we are going to use materials to build certain aspects of our machine we managing resource management by writing down the cost of each product and also who is going o transport which product on the day of creation.",
    "result": "The combined efforts of these actions culminated in a cohesive and strategic approach to both the presentation and the RGM project. This approach not only facilitated the successful completion of immediate tasks but also laid the groundwork for enduring teamwork and effective project execution. Thanks to our well-structured approach and effective time allocation, we delivered a polished and engaging presentation that effectively conveyed our ideas. Our presentation was well-received by our peers and garnered valuable feedback. For the RGM project, our collaborative brainstorming led to a diverse range of innovative ideas. Through careful evaluation and refinement, we narrowed down our concepts to a few strong directions. The outcome was a set of well-defined plans and design materials that laid a solid foundation for the next phases of the project. By strategically managing time, promoting collaboration, and balancing tasks, we achieved a successful presentation and set our RGM project on a promising trajectory. This experience underscored the importance of effective planning and teamwork in achieving project goals.",
    "id": "Ref_0067"
  },
  {
    "situation": "In _Software Design Logic_, we were tasked to complete a multitude of activities before signing off for the day. These activities revolved around familiarising yourself with the coding language C and applying principles of modularity and reusability. For example, user-made functions in a _Rock, Paper, Scissors_ C program were to be edited and successfully integrated to make the game work. This was then presented to a tutor.",
    "task_action": "Up until this point, I had no further understanding of what C was, what modularity was or how to achieve reusability. This was when the skill: clear communication and solid teamwork, was being developed. A good friend of mine was in the same ENGG1000 unit as I was, and I was able to ask them deliberate questions that would help extend my understanding of C and coding in general. They helped me understand how to create user-made functions and how to successfully utilise them.",
    "result": "Their assistance and guidance has helped me develop a better understand about code and how it can be utilised. They have helped me complete the tasks that we were assigned to do. (The code provided to us was a _Rock, Paper, Scissors_ program that required the programmer to understand how to use its user-made functions and test them using code. Their teachings has helped me complete them).",
    "id": "Ref_0068"
  },
  {
    "situation": "Firstly, I'd like to note that I currently work as a steelfixer in the construction industry to make a living, even though my actual field of study is software engineering. On one particular occasion, my co-workers and I were tasked with setting up steel protection for a clean water supply pipe in a major suburb in Sydney.",
    "task_action": "We began by reviewing engineer plan. This entailed ensuring all measurements, such as the concrete's height and width, all fundamental aspects of steelfixing were clarified and comprehended. With all the necessary information in hand, my co-workers and I distributed roles: deciding who would cut the steel, who would handle measurements, and who would be responsible for lifting and transporting the bars.",
    "result": "Despite the initial plan not being entirely fit to real world conditions, our team proficiently and independently addressed the problem, successfully repairing the clean water supply pipe. After our intervention, we confidently handed over the restored system to the lead engineer for final evaluation.",
    "id": "Ref_0069"
  },
  {
    "situation": "In a programming course focused on honing critical thinking skills, the assignment was to individually create a C language code for a rock-paper-scissors game. The task required not only technical proficiency but also critical analysis and problem-solving abilities to develop an efficient and logically sound solution.",
    "task_action": "To approach this task with critical thinking, I began by thoroughly understanding the game's rules and requirements, breaking them down into logical components. I critically analyzed the problem, identifying potential challenges and areas where critical decision-making would be essential. Next, I formulated a plan to implement the game, considering factors such as user input validation, random selection of the computer's choice, and determining the winner based on the chosen options. This involved breaking down the problem into smaller, more manageable tasks and considering multiple potential solutions for each. Throughout the coding process, I continuously applied critical thinking skills to evaluate the effectiveness and efficiency of my code. I considered factors such as code readability, efficiency, and scalability, making informed decisions to optimize the code structure and improve its overall quality. When encountering challenges or ambiguities during implementation, I engaged in critical problem-solving, carefully analyzing the problem from different angles and considering alternative approaches. This involved debugging and troubleshooting, as well as seeking input from peers or resources to gain new insights and perspectives.",
    "result": "By applying critical thinking skills throughout the development process, I successfully created a functional and well-structured C language code for the rock-paper-scissors game. The implemented solution effectively handled user input validation, generated random choices for the computer, and accurately determined the winner based on the game's rules. Moreover, the experience of developing the code enhanced my critical thinking abilities, particularly in the areas of problem-solving, decision-making, and analytical reasoning. It underscored the importance of approaching programming challenges with a critical mindset, systematically analyzing problems, considering alternative solutions, and continuously evaluating and improving the code. Overall, the assignment served as a valuable exercise in integrating technical proficiency with critical thinking skills in software development",
    "id": "Ref_0070"
  },
  {
    "situation": "We needed to brainstorm a conceptual and a preliminary design for our Rube Goldberg Machine.",
    "task_action": "Considering the complexity of a Rube Goldberg Machine and the fact we were communicating online through Zoom meetings, our team decided to use Miro boards to start with initial ideas on sticky notes. Then through strong teamwork which led to smooth communication we were able to create a mind map like ordered event line up.",
    "result": "The result was then being able to use the brainstorming we had undertaken and use it draw up our conceptual design. After doing so we evaluated the risks and other complications linked to it to further narrow our design to make our preliminary design.",
    "id": "Ref_0071"
  },
  {
    "situation": "DURING MY SOFTWARE DESIGN LOGIC WORKSHOP, I HAD TO FAMILIARISE MYSELF WITH THE C PROGRAMMING LANGUAGE AND USE IT IN MY PROJECT.",
    "task_action": "UPON LEARNING ABOUT THE PROJECT DUE AT THE END OF THE WORKSHOP; CREATING A SCISSORS, PAPER AND ROCK GAME WITH MULTIPLE VARIANTS, ROUNDS AND ALGORITHMS, I HAD TO ENSURE I WAS AWARE OF THE C PROGRAMMING LANGUAGE LOGIC. SUBSEQUENTLY, I ENSURED ALL MY TASKS DURING THE WORKSHOP WERE BEING COMPLETED AND I STUDIED THE C PROGRAMMING LANGUAGE GUIDE.",
    "result": "THE RESULT ENSURED THAT I WAS FAMILIAR ENOUGH WITH C PROGRAMMING TO WORK ON MY PROJECT BIT BY BIT, FOR EXAMPLE, ONCE I BECAME FAMILIAR WITH THE FOR LOOPS, I FIGURED OUT HOW TO IMPLEMENT MULTIPLE ROUNDS FOR MY PROJECT. THE PROJECT WAS BEING WORKED ON AS I BECAME FAMILIAR WITH THE PROGRAMMING LANGUAGE AND I WAS ABLE TO DELIVER A FINISHED PROJECT.",
    "id": "Ref_0072"
  },
  {
    "situation": "OUR TEAM FACED A CRUCIAL PROJECT WITH A VERY TIGHT DEADLINE. OUR TUTOR SET A COMPLETION DATE JUST TWO WEEKS AWAY, AND MISSING IT COULD LEAD TO SERIOUS PENALTIES AND EFFECT OUR TEAM'S REPUTATION.",
    "task_action": "AS THE GROUP LEADER, I HAD TO MAKE SURE WE FINISHED THE PROJECT ON TIME AND WITHIN OUR SMALL BUDGET. THIS MEANT CAREFULLY MANAGING OUR TIME AND RESOURCES, ESPECIALLY SINCE WE HAD OTHER PROJECTS GOING ON TOO.",
    "result": "THE RESULTS WERE GOOD AS WE SUCCESSFULLY DELIVERED THE PROJECT ON TIME. THE TUTOR WAS HIGHLY SATISFIED WITH OUR EFFICIENCY AND THE QUALITY OF THE WORK. BY EFFECTIVELY MANAGING RESOURCES AND TIME, WE COMPLETED THE PROJECT WITHIN THE ALLOCATED BUDGET, AVOIDING ANY FINANCIAL PENALTIES.",
    "id": "Ref_0073"
  },
  {
    "situation": "We faced a problem where our software's response time was slow, resulting in poor user experience and customer satisfaction.",
    "task_action": "We identified the root cause of the problem and realized that the codebase had several performance issues. To address this, we formed a small working group and set the task of optimizing the codebase for better performance. We conducted a thorough code review and identified the code segments responsible for the slow response time. We then implemented several optimization techniques, such as refactoring, caching, and code parallelization, to improve the performance.",
    "result": "As a result of our actions, the software's response time was reduced by more than 50%, resulting in significant improvements in user experience and customer satisfaction. Additionally, the software's stability improved, and we received positive feedback from our stakeholders. Our efforts also reduced server load and operational costs, resulting in a more cost-effective solution for our organization.",
    "id": "Ref_0074"
  },
  {
    "situation": "Through the RGM process we had to take our previously established designs and apply critical thinking and logical analysis to construct a cohesive and reliable RGM to explore our engineering and problem-solving skills",
    "task_action": "Interpreting complex designs in a group session; organising a meeting time for everyone to bring their designs to the group to establish any technical issue and to gain insight on how others use critical thinking and problem solving to take what is on paper into something physically that works as intended. This gave us a chance to brainstorm as a team, where we could come up with alternative methods to the more complex ideas. We engaged the team through a round-robin brainstorming method to allow everyone to get a chance to voice their opinion, evaluating each suggestion with a majority vote/discussion to determine the best solution.",
    "result": "This allowed an individual in the group to receive critical feedback on their initial designs from a group's perspective which assisted in the individual approach when interpreting and analysing their designs. This time saved on the construction process as the designs have been adjusted to work more efficiently and reliable, also allowing us to develop the skills of problem-solving and critical thinking to bring into our next project",
    "id": "Ref_0075"
  },
  {
    "situation": "In our workshop, we were tasked with creating an algorithm that was able to more efficiently calculate the winner of a scissors paper rock game.",
    "task_action": "As we had, up to that point, only worked with hard coding win-outcomes into our programs, I had to use my prior maths knowledge to take my mind away from the coding and towards a theoretical solution. I converted the problem to numbers rather than words, and asked myself what the objective was and what I needed the algorithm to do. By doing this, I was able to use create a new, theoretical solution to the algorithm problem.",
    "result": "The result of this method of brainstorming the concepts of my code outside of my program allowed me to break down the problem into the main ideas. It ultimatley allowed me to develop a solution to the problem by creating a mathematical algorithm, then converting it into code for the game after this.",
    "id": "Ref_0076"
  },
  {
    "situation": "We needed to discuss the making of a realistic model of a student’s accommodation.",
    "task_action": "Firstly, we had to make a group of a maximum of six people and get to know each other as that would help us to communicate among ourselves. Secondly, we started to share our ideas on the topic and then subsequently, we evaluated each of our ideas and then chose the one that suits our work criteria and goes perfectly with all of us which would give us our desired model. Alongside, we then made our strategies by discussing between ourselves and giving opinions as in a team each and everyone’s opinions matter.",
    "result": "Through this task, we got done with a model of a modular student’s accommodation and a report that states every step of our work from the very beginning. After implementing the ideas discussed in the class, we came up with 5 storied buildings with a total of 1580m2",
    "id": "Ref_0077"
  },
  {
    "situation": "During week 6 our group had a meeting to discuss the feasibility and implementation of our actions that make up the RGB mechanism.",
    "task_action": "Combining our different perspectives and knowledge in the relevant contexts of the RGB machine, we evaluated our then-current preliminary design to determine weaknesses and strengths in our 12 individual actions. We discussed the roles of each person in testing different parts of the machine to brainstorm possible alternative designs to our RGB machine considering our materials, conditions, and the likelihood of each action working.",
    "result": "The result was implementing an alternate design and allocating a deadline in which each member of the group would test a part of the machine. At the deadline, we will communicate our individual evaluations of our parts.",
    "id": "Ref_0078"
  },
  {
    "situation": "We needed to assign each other roles for the work that included making the model, presentation and report to make sure the work was done on time with top-notch quality.",
    "task_action": "One person assigned the rest of the members and being fair with the amount of work each member was going to do all members were asked if they were fine with the amount of work given. To balance the amount of work given the approximate time needed to complete the task was taken into account. As one member was in charge of the 3d model that's all he had to do because it wouldn't take a short amount of time to complete and to lessen the burden and improve the quality of work. If anyone had concerns about the amount of work they had to do, such as being given too much, they were able to communicate through social media where each member is regularly online and able to respond quickly.",
    "result": "Through excellent teamwork and communication, each member was aware of the work they had to complete. After efficient communication, we were able to complete the work with little errors through thorough communication and teamwork between the members.",
    "id": "Ref_0079"
  },
  {
    "situation": "During the week 6 ENGG1050 workshop, all teams had to present their ‘Preliminary Design’ to their tutor and class and then provide constructive feedback to the team that presents after.",
    "task_action": "As it was my turn to be the spokesperson/presenter for week 6, I presented the ‘Preliminary Design’ and also our ‘RGM Event Ideas’ as we had time to spare in the 5 mins we were allotted for our presentation. Following that, we got some positive feedback from Innes (our tutor) and the class regarding my diagram for the preliminary design, our ideas for the RGM and my presentation as a whole. I also received some feedback on how I could improve the presentation and make the diagram more detailed.",
    "result": "I was able to present the preliminary design to the class effectively and confidently, as confirmed by the positive feedback I received, but I also was able to gain a lot of constructive feedback which will allow me to improve on my presentation skills and help the team with creating better designs.",
    "id": "Ref_0080"
  },
  {
    "situation": "At the end of my group's civil modelling task, we were assigned to deliver a group oral presentation on our design.",
    "task_action": "My task was to develop a computer generated 3D model of our group's building, and record a tour that would engage the audience. I conducted thorough research, designed an informative model and created visually appealing slides. I practiced extensively to maintain an eloquent delivery and incorporated expressive hand gestures to emphasise my points.",
    "result": "The presentation was well-received, earning high praise from the academic tutors and positive feedback from our peers. My clear and articulate delivery helped to enhance the overall impact of the oral presentation.",
    "id": "Ref_0081"
  },
  {
    "situation": "After the week six tutorial for ENGG1050, one of our team members was responsible for that week's upload of our weekly minutes, agenda and reflection.",
    "task_action": "After class, I took initiative and followed up with this team member to double check they were in the process of finalising/uploading the document and to review the document prior to submission. I wanted to review the document as the group had not received high marks for this submission in previous weeks (marks of 3/10 & 4/10 for weeks 4 and 5 respectively). The member informed me that they had decided they were not going to submit the documents this week. This decision was not communicated to team members and had I not followed up with this team member, I doubt the document would have been handed in at all. In response to this, I informed the team member that it was absolutely unacceptable to not communicate such a decision with the group and that with their current poor in class involvement (eg, lack of involvement in group discussions, RGM themes and ideas, completion of in class assignments, group presentations, failure to use their camera during sessions and overall lack of communication) that the delegation of this task to them was a more than reasonable portion of the workload. Furthermore, given the time available to this member due to their inactivity with our group and in class sessions, they should be able to complete this simple task to an extremely high standard.",
    "result": "Following the confrontation, the team member was willing to commit to the assigned task and successfully handed in the documents.",
    "id": "Ref_0082"
  },
  {
    "situation": "We had to design an algorithm for the 'rock', 'paper', or 'scissors' game in our first workshop so that the game runs three times.",
    "task_action": "Firstly we formed a group of five, discussed the procedures and came to a decision about how to start. While starting with the decomposition of the problem, we shared opinions about what the inputs, outputs, constraints should be. We proposed multiple options, and picked those which seemed logical to all of us.This helped us a lot for the subsequent steps, such as identifying the pattern, abstraction about key elements and step into drawing the algorithm.",
    "result": "Each of us, using the gathered patterns and key elements, designed our own algorithm and then cross-checked each other's design. We modified some aspects together and generated the final flawless flowchart to further work on it.",
    "id": "Ref_0083"
  },
  {
    "situation": "My ENGG1000 Civil modelling skill was to conclude to with a group presentation based on the final report.",
    "task_action": "The first course of action was to prepare the presentation slides and that required us to breakdown the report into sub topics for a slide each. Upon completion of this phase, we allocated a sub topic to a group member each to prepare to speak on it during the presentation.",
    "result": "The result was each group member receiving topics to speak on that matched their contributions to the final report and slides that contained key points of the topic they had to elaborate upon.",
    "id": "Ref_0084"
  },
  {
    "situation": "I needed to cut my piece of steel in order to make the pannels of my toolbox, however there were lines forming stopping me from doing so.",
    "task_action": "While I waited for others to cut, I focused on etching all the necessary marks for the cutting & bending process later along the track. I was then able to cut my piece at a later time & have my pieces marked so I could go straight to bending my piece.",
    "result": "The result was being able to select a process of importance, allowing me to prioritise my work effectively & continue to work with my project while others waiting in lines achieving nothing.",
    "id": "Ref_0085"
  },
  {
    "situation": "I need to figure out how to turn a binary number into a decimal number.",
    "task_action": "It was challenging to figure out how to turn the binary number gathered from the Arduino board and turn it into a number to display on the LCD screen. I really wanted to give up and just receive marks based off of what I completed but I decided to persevere because I wanted to deliver a complete assignment. I had to be resourceful so I turned to both my peers and internet research, I learnt that I could use a function to create the logic to turn a binary array into a decimal. Even though defining my own function was out of my comfort zone I decided that I'd be flexible and give it a try.",
    "result": "I was able to define my own function called \"int binaryToDecimal\", which when called could take an away and run a formula which would then return an integer that equals the value of the array.",
    "id": "Ref_0086"
  },
  {
    "situation": "I had to manage plenty of activities and exercises for my workshop at the University and I was also preparing for weekly quizzes and assessments at the same time and was also involved in clubs and activities, going to classes, and having a part-time job. I soon grasped the value of managing my time and assets to be successful in every task and exercise considering what was going on.",
    "task_action": "My duty was to calculate how I spend time throughout the day and make some time to solve the problem that I was facing in my workshop. And, to figure out a way to solve each of my commitments and make sure that I utilize all my time and assets wisely to accomplish my objectives. Firstly, I made a timetable for myself, prioritizing my most important tasks and giving additional time to those tasks and exercises which needed additional concentration and focus. I also organized my schedule by setting reminders for significant deadlines using a time management app. To remain focused and avoid interruptions like social media notifications.",
    "result": "I ended up effectively handling every single of my obligations and fulfilling my objectives. I completed my exercises for the workshop at the given time, did well at my part-time work, contributed significantly to my extracurricular events, and scored satisfactory scores. Thus, I learned the significance of setting priorities, being organized, and being disciplined to effectively manage resources as well as time.",
    "id": "Ref_0087"
  },
  {
    "situation": "For my software design and logic workshop, we were required to make a rock, paper, scissors (RPS) game in C, we also were given the task to add 2 more gestures, lizard, and spock.",
    "task_action": "In C, programming can take lengthy times, thus, I utilised time management and completed the work of the games beforehand, so I had time to refine it in class. In summary, I did majority of the work at home and refined it in class to maximise the benefits of time management. Resource management was also utilised, since I could access the C program compiler online at home.",
    "result": "The RPS game was successfully implemented and used in the workshop. Players were able to interact with the software, see the results of their inputs of gestures. This experience enhanced my skills in coding, and project presentation.",
    "id": "Ref_0088"
  },
  {
    "situation": "I had to create a toolbox, using either aluminium or steel. I chose to use aluminium.",
    "task_action": "In this unit, we had to use a mixture of small and large, heavy-duty tools, which meant we had to know what each tool was used for, how they function and what materials can be used when using those tools. By having class discussions before entering the machining area, we were able to discuss the differences between machines and their functionality, along with safety precautions, and things we needed to do to keep ourselves, our peers, and our surroundings safe, such as tying hair back, tucking lose clothes, and wearing safety glasses.",
    "result": "The result was being able to learn and use these heavy machines to complete our project, in a safe and sensible manner. We were also able to help those who were stuck on using machines, such as how to use a deburrer to make our cut edges smooth.",
    "id": "Ref_0089"
  },
  {
    "situation": "We needed to present our progress on the RGM project each week to the other teams.",
    "task_action": "We discussed who was to present each week, to try to rotate through the team, and also keep in mind elements of presentation when completing the work. Having a good layout and flow allowed easier oral presentation of the project, and comparing with other teams allowed us to determine how to improve our presentation for the following week.",
    "result": "While initially somewhat haphazard over the first few weeks, our oral presentation became better as we became more used to the task, and we had better understanding of the requirements for both the oral presentation and supporting visual presentation.",
    "id": "Ref_0090"
  },
  {
    "situation": "In Year 12 our engineering studies class had an assignment to create a rocket and reach high altitudes by modifying and innovating the design of the rocket.",
    "task_action": "The rocket design started with a 2-litre bottle without any modifications, resulting in a height of 15 meters. After receiving a baseline height, we attached a nose cone to the top of the rocket. We used a styrofoam dome, which reduced the height to 13.1 meters. So, we innovated the design to the conical top half of a Coke bottle, which enhanced the height to 17.7 meters. Following this, we constructed our first set of rocket fins, consisting of four elliptical wooden fins, which achieved a height of 9.7 meters but proved excessively heavy. We then redesigned the fins innovating it by using corflute material and changing the amount of fins to three elliptical fins, resulting in an improved trajectory of 16.4 meters. Further innovation led to a redesign of the fin shape into a trapezoidal fin, which allowed for rocket to reach a height of 20.3 meters, showing successful innovation. Our final innovation involved the addition of an epoxy resin cone to the top which replaced the Coke bottle conical top, this enhanced the tip and provided a counterweight, causing the best result of 27.5 meters.",
    "result": "The results showed how the innovation process is used to improve the rocket altitude. this was proven successful with the final rocket launch being 27.5m",
    "id": "Ref_0091"
  },
  {
    "situation": "During our Software Design Logic workshops, we faced a series of coding challenges that required not only implementing software but also understanding the underlying logic. The pinnacle of these workshops was a final project where we had to create various versions of the game Rock-Paper-Scissors, including extended versions like Rock-Paper-Lizard-Spock and even more complex ones with 7, 9, and 11 gestures.",
    "task_action": "Our task was to develop algorithms and implement code for these game variants. We started by creating flowcharts to visualise the algorithms before diving into the coding phase. This involved critical thinking to determine the optimal structure and logic for each game variant. We had to thoroughly analyse the rules and interactions between gestures, ensuring our logic was robust and adaptable for more complex variants. Additionally, we performed unit tests to validate the correctness of our implementations.",
    "result": "Through precise planning and critical analysis, we successfully developed and implemented the code for all required game variants. Our flowcharts proved to be invaluable in organising our thoughts and providing a clear path for coding. The unit tests confirmed the reliability of our algorithms, ensuring that each game variant operated correctly. This process not only helped us complete the project successfully but also honed our critical thinking and problem-solving skills.",
    "id": "Ref_0092"
  },
  {
    "situation": "We needed to design a Rube Goldberg Machine (RGM) as a team of six, with each section of the machine to be completed by one person. All sections must be filmed individually and compiled into one video which demonstrates seamless transitions between all sections of the RGM. The team members met only over Zoom, with each person having access to different materials. The RGM was required to have a consistent theme and relevant end goal.",
    "task_action": "Each member of the team chose their own section of the RGM, in which we came up with our design individually, and built the section individually. We all tested our sections for reliability and worked individually on improving the reliability of our respective sections. Filming was also done individually.",
    "result": "The result was a somewhat choppy series of videos in which some sections of the RGM were vastly more reliable than others.",
    "id": "Ref_0093"
  },
  {
    "situation": "For my ENGG1000 course, I was tasked with developing a C program to play the Rock Paper Scissors Lizard Spock game. This was an individual assignment with a strict deadline. Additionally, the second part of the assignment required creating a LinkedIn account and connecting with classmates to build a professional network.",
    "task_action": "To manage my time and resources effectively, I created a detailed schedule that allocated specific hours for coding, debugging, and testing the C program. I broke down the project into smaller tasks, such as designing the game logic, writing the code, and performing unit tests. For the LinkedIn part of the assignment, I set aside time to create my profile, write a professional summary, and reach out to classmates. I used a timer to keep track of my study sessions and took regular breaks to maintain productivity.",
    "result": "The structured approach allowed me to complete the C program well before the deadline, with all features functioning correctly. I was able to debug efficiently and test the game thoroughly. Additionally, I successfully created my LinkedIn profile and connected with several classmates, establishing a budding professional network. The project was well-received, and I gained valuable feedback on both my coding and networking skills.",
    "id": "Ref_0094"
  },
  {
    "situation": "As we progressed through the semester, more robust communication within our team was required in the form of written communication, and documentation was needed to help us be effective. If not done, it would have led to confusion and high pressure to complete planned activities.",
    "task_action": "As we were working on the RGM machine submission in the initial weeks, we had miscommunications with our team leading to deadlines coming down to the wire. To overcome this situation, we devised a communication strategy that included incorporating communication required during the definition of the problem, the solution phase, and its execution. As time progressed, we realised that effective and necessary communication is a crucial criterion for our overall success.",
    "result": "Our actions translated to a clear, structured approach for all our presentations and the upcoming video for the final submission. The brainstorming sessions were more structured, leading to a productive outcome in the form of higher-quality ideas. The three-step process, as described above, made it easy to filter/sort the ideas and rank them consistently as we communicated effectively. Additionally, it enabled us to create more precise and concise diagrams regarding the working of our RGM on miro.",
    "id": "Ref_0095"
  },
  {
    "situation": "We recently encountered a customer who operated a manufacturing facility experiencing issues with its wastewater treatment system. The plant had an outdated and underperforming wastewater treatment system. This was causing regulatory and environmental problems due to its ineffective treatment capabilities.",
    "task_action": "Our challenge was to design and implement a more sustainable wastewater treatment system to meet regulatory requirements and minimize the company’s footprint. We assembled a diverse team of water management, chemical processing, and environmental engineering experts to tackle this complex problem. First, we conducted a comprehensive review of the existing business wastewater treatment system to identify key areas that must be addressed. Then we examined innovative technology and best practices in the wastewater treatment industry. We focused on methods that require minimal energy, chemicals, and waste. Based on our assessments, we recommended a multi-pronged approach that included investing in the company’s treatment plants to incorporate state-of-the-art equipment such as membrane bioreactors and advanced oxidation systems. The company was also recommended to implement recycling programs. Other process improvements were generated to enhance resource recovery and reduce waste. In the implementation stage, we worked closely with the company’s technical staff to ensure the proper setup and operation of the new systems and processes. Training and support were provided to help the staff adapt to the changes and to improve the systems’ performance over time. All these measures led to a significant reduction in the company’s waste footprint and the diversion of substantial amounts of recyclable materials",
    "result": "Our sustainable wastewater treatment solution significantly benefits to both the company and the environment. The company saved water, electricity and chemicals, leading to increased production efficiency and lower operating costs. Furthermore, the new treatment plant enabled a considerable reduction of pollutants discharged into nature which helped preserve the nearby natural ecosystems and fulfilled legal regulations. In summary, our solution addressed pressing environmental concerns and contributed to corporate sustainability. This real-life example demonstrated to the students how engineering can work towards creating a better society and environment.",
    "id": "Ref_0096"
  },
  {
    "situation": "We needed to communicate in such a way that parts and objects that we want to have created can be made by other people.",
    "task_action": "Learn the different types of technical drawing styles and how to draw using them, draw various shapes in each style of drawing and implementing scale into the drawing styles that allow for it. This taught us how to draw all the different shapes in the different drawing styles and what each drawing style is used for.",
    "result": "The result was use being able to draw the objects that we would want to be manifested into a language that the manufacturing industry can use to create the parts. We completed these with various objects to further out skills.",
    "id": "Ref_0097"
  },
  {
    "situation": "We needed to create the project of RPS (Rock, Paper, Scissors) using the program of c. Where several errors were encountered.",
    "task_action": "When creating my code, I encountered several issues with my code that made me agitated and frustrated ruining my attitude towards the situation, my thought process and mentality were numbed down where I was thinking \"What's the issue with this?\", and \"I'm never going to finish this\". That was all in the moment, after taking a break and calming down from anger my positive attitude returned, with this I decided to try and teach myself and learn different methods to fix my errors which overtime worked.",
    "result": "In the end through teaching, learning and keeping a positive attitude I was able to complete the task and fix the errors that were involved within",
    "id": "Ref_0098"
  },
  {
    "situation": "My peers and I had to learn how to use different tools in the machining workshop to create my toolbox.",
    "task_action": "In this unit, my classmates and I had to use a mixture of small and large, heavy-duty tools, to create our toolbox, and to use these machines we needed to know the functionality of each tool, and what materials can be used on those machines. To help understand and grow our knowledge on these tools, our demonstrators, made sure we had class discussions before entering the machining area, as well as created Kahoot quizzes, so that we further understood the machines functionality, and so that out demonstrators also know how much we took in the information discussed before intaking the quiz.",
    "result": "The result was being able to learn and use these heavy-duty machines to complete our project, in a safe and sensible manner. Due to the mix communication of class discussions and Kahoot quizzes, our demonstrators were able to create a friendly and engaging environment as well as convey these useful and important information in a fun and engaging manner.",
    "id": "Ref_0099"
  },
  {
    "situation": "In my ENGG2050 unit, one of the very first tasks we had to accomplish was creating a conceptual solution for an Internet of Things (IoT) Tea Maker. When this was first explained to us, I felt very lost, as I hadn’t done any sort of design similar to this. I felt even more overwhelmed when we were told that this design was going to be required in order for us to complete another assessment later in the semester (A6 Video Presentation). I felt as though I was going to fail the unit before it had even started. However, this is where my chosen soft skill came into play. My skills in “creating new solution concepts” were still very limited as I had only completed two semesters so far and didn’t have too much experience in applying myself to create real world solutions. So, during the semester I had to figure out a way to use and further hone my skills in creating new solutions. Doing this was going to be vital, not only for my final grade but also in order for me not to feel too overwhelmed by what was expected of me.",
    "task_action": "The task presented to me at the start of my 3rd semester at university in my ENGG2050 unit was to create a conceptual solution for an Internet of Things (IoT) Tea Maker. I had to not only meet the different criterias given to us but also ensure that if my solution was to be implemented in the real world, it would work. Whilst I didn’t have to delve into the actual physical implementation of the Tea Maker (i.e. the electrical, mechanical and other components), I had to create a solution that if given to an actual manufacturer or company, they would be able to implement the solution. This meant that I had to consider every possibility of what could go wrong and describe the details of the IoT Tea Maker in as much detail as I could. I was able to complete this through the help of my soft skill and the weekly SGTAs. The very first step that I took was to ask questions in the public discussion forum on iLearn. As this task was supposed to replicate a real world scenario as accurately as possible, we were tasked with asking questions on the discussion forum, where the unit convenor would reply from the perspective of a customer. From this we were expected to extract relevant information to identify the needs of the customer. I made sure to ask even the briefest questions I had. Additionally, not only were we given responses to our own questions, but also the questions that other people asked and their responses. From the discussion forum, I copied every question/answer into a document and underneath jotted down a couple of sentences on how I would be able to meet the customer’s requirement for that dot point. Here I was able to use my soft skill (creating new solution concepts) from my previous experiences of creating software solutions in other units. From experience, I knew that the very first step in creating a solution was to identify the requirements. I knew that these requirements were going to form the basis for the more detailed functions that I was going to have to describe. By calling on my soft skill, I was able to reduce the initial feeling of overwhelmingness I felt when the task was given to us. The next action I took was discussing and brainstorming possible designs in a group. Despite having previous experience in working in groups, I was still a bit nervous when we had to discuss our ideas with people who we had just met. However, this discussion was greatly beneficial as the group discussion highlighted different ideas and solutions for the tea maker that I had not considered. As we all came from different disciplines, the group discussion was very effective and we were able to gain insight from different perspectives. This action helped me realise the important role that group discussions play when creating a new solution. I was able to improve my chosen soft skill through this. Another action that I took was to consider the worst case scenario for certain aspects of the tea maker. For each individual function that I had described for my tea maker, I decided to question it and ask myself what would happen in the worst case (e.g. One of the functions was to store milk and my worst case scenario question was, what would happen if someone stored another liquid that could result in a possible accident?). This form of testing and evaluating my solution enabled me to see how I would be able to improve my solution. Moreover it taught me what scenarios to consider for the next time when I have to create a solution. This action helped me improve my “creating a solution” skill as I was able to learn how to reflect, question and improve my ideas.",
    "result": "My efforts were intended for me to use and improve my skills in creating a solution by creating a solution for my ENGG2050 IoT Tea Maker. Despite having limited experience with this soft skill and my discipline being Software Engineering (in which everything is very binary i.e. yes/no, 1/0) I was able to create a solution that could hypothetically be given to a manufacturer as an initial design. Furthermore, because of the actions that I implemented, I was able to improve my skills in creating a solution. Such a skill is going to be needed in future units and also my career. Knowing how to effectively create a solution concept is the basis of implementing successful engineering solutions. By improving my skills and completing my IoT Tea Maker solution to the best of my ability, I was content in my work and the initial daunting feeling I had when coming into this unit was gone.",
    "id": "Ref_0100"
  }
]